app/Models/Buku_model.php

    public function getBuku($id = false)
    {

        $builder = $this->db->table('tbl_buku');
        if ($id == false) {
            $query = $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_buku`